[
	{
		"projectName": "Strong men",
		"prejectType": "Unity game",
		"projectDescription" : "I took part in Microsoft’s 24h Hackathon in December 2015 with a game made in Unity using C# as the programming language. The subject of the contest was \"Strong men\" and me and my teammate created a game with three levels where you must prove you’re a real man by shaving, catching objects thrown by your wife and cooking “mici” on the barbeque.",
		"projectDemo": "demo_0",
		"projectGallery": [
			"0_1.png",
			"0_2.png",
			"0_3.png",
			"0_4.png",
			"0_5.png",
			"0_6.png"
		]
	},
	{
		"projectName": "LTeam",
		"prejectType": "Web Tool",
		"projectDescription" : "I created a small tool for generating two teams formed of random members. All the players would go and pick a nickname after which a captain generates two teams. I’ve used Node.js for the webserver and bootstrap for pages design. I’ve also used sockets for real-time connection between players. The leader website address is http://lteama.tk and the participants address is http://lteam.tk.",
		"projectDemo": "demo_1",
		"projectGallery": [
			"1_1.png",
			"1_2.png",
			"1_3.png",
			"1_4.png",
			"1_5.png",
			"1_6.png",
			"1_7.png"
		]
	},
	{
		"projectName": "Board",
		"prejectType": "Tool",
		"projectDescription" : "Another small application I created using Visual C# is an application that given a piece of material (iron sheet, piece of cloth, etc.) of certain dimensions that has holes in it, gives you the two optimal cuts that can be applied to the piece in order to obtain one without holes",
		"projectDemo": "demo_2",
		"projectGallery": [
			"2_1.png",
			"2_2.png",
			"2_3.png",
			"2_4.png",
			"2_5.png",
			"2_6.png",
			"2_7.png"
		]
	},
	{
		"projectName": "iziApp",
		"prejectType": "Web application",
		"projectDescription" : "In December 2016 me and two colleagues attended to the 3ITC contest organised by ITIMF department of the University “Petrol-Gaze” from Ploiești. We’ve obtained the first place with the application “iziApp”. The main purpose of this application is to ease the communication and interaction between a teacher and his/her students. The application allows a teacher to create accounts for each student, to create and manage multiple classrooms, post certain information about upcoming events in every classroom he/she created or even send and download resources like electronic books, tutorial videos, exercise files, etc. Another feature of this application is the possibility of creating and sending quizzes. For example, at the end of a lesson a teacher can create a set of questions to test his/her students’ knowledge. The quiz appear on everyone’s device and they answer those questions while the teacher gets real-time feedback. For developing this application I’ve used Node.js along with express framework for implementing MVC pattern and sockets for real-time interaction. For templating the application uses EJS Templating language and the front-end of the application uses the bootstrap framework. The application is available at this address: https://iziapp.herokuapp.com",
		"projectDemo": "demo_3",
		"projectGallery": [
			"3_1.png",
			"3_2.png",
			"3_3.png",
			"3_4.png",
			"3_5.png",
			"3_6.png",
			"3_7.png",
			"3_8.png",
			"3_9.png",
			"3_10.png",
			"3_11.png",
			"3_12.png",
			"3_13.png",
			"3_14.png",
			"3_15.png",
			"3_16.png",
			"3_17.png"
		]
	},
	{
		"projectName": "ShopMApp",
		"prejectType": "Android Application",
		"projectDescription" : "I took part in Adfaber’s hackathon with the application ShopMApp. This application runs on Android devices and its purpose is to ease a person’s shopping activity. You have to choose the products you’re looking for in a supermarket and the app finds an optimal way for you to get all the items you asked, marking them on a store map. For example, when you go shopping you don’t know all the items’ location in that store you’re in, so by checking with the application you can easily see where the product you’re looking for is located, or you can create a shopping list from home and follow the map indications when you are in the store. For this application I’ve used Java as the programming language and XML for the design, the Android Studio IDE and Oracle Database for the database.",
		"projectDemo": "demo_4",
		"projectGallery": [
			"4_1.png",
			"4_2.png",
			"4_3.png",
			"4_4.png",
			"4_5.png",
			"4_6.png",
			"4_7.png",
			"4_8.png"
		]
	},
	{
		"projectName": "B0xiT",
		"prejectType": "Android Game",
		"projectDescription" : "I’ve created a game for mobile devices named B0xiT. I’ve used Unity as the IDE and C# as the programming language. This is a puzzle game in which the player must drag a box on the production band to collect stars and complete some challenges. The perspective is from above the box, and the playable area is not visible from the start. As long as the player reveals the map, he can discover obstacles and rewards used to complete the level.",
		"projectDemo": "demo_5",
		"projectGallery": [
			"5_1.png",
			"5_2.png",
			"5_3.png",
			"5_4.png",
			"5_5.png",
			"5_6.png",
			"5_7.png",
			"5_8.png",
			"5_9.png",
			"5_10.png",
		]
	},
	{
		"projectName": "Network Navi",
		"prejectType": "Application",
		"projectDescription" : "My bachelor’s degrees subject was ”Application for 3D navigation within a computer network”. It consisted of two major parts. A software that permits representation of the 3D space and a software that retrieves the information about connected devices. For developing my project I used the ITIMF computers and network equipment. The computers were running Windows operating system. For the retrieval of the computer’s information (hostname, IP address, MAC address, Operating System) I’ve created a Windows service that implements a protocol named CDP (Cisco Discovery Protocol) which creates a packet with the information needed and sends it on each network interface the computer has. I’ve created this service using C++ programming language and the Linux similar program. For the 3D representation of the network I’ve used the Unity IDE with C# programming language. The application connects to a server through a websocket and retrieves the information it needs to render all the elements (rooms, PCs, switches, routers, servers, printers). The user can interact with the objects and move them around or find useful information about them (hostname, IP address, MAC address and connectivity like the status of the device: on or off). This is an useful application because it eases the job of an IT technician.",
		"projectDemo": "demo_6",
		"projectGallery": [
			"6_1.png",
			"6_2.png",
			"6_3.png",
			"6_4.png",
			"6_5.png",
			"6_6.png",
			"6_7.png",
			"6_8.png",
			"6_9.png",
			"6_10.png",
			"6_11.png",
		]
	}
]